IDEA StatiCa Open Model
Plane Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Defines basic planes
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum Plane
Public Enumeration Plane
public enum class Plane
Members
Member name | Value | Description
XY | 0 |  XY Plane - Plane normal to Z axis
YZ | 1 |  YZ Plane - Plane normal to X axis
ZX | 2 |  ZX Plane - Plane normal to Y axis
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace